tap "supabase/tap"
# Essential terminal utilities
brew "starship"      # Cross-shell prompt
brew "fzf"           # Fuzzy finder
brew "eza"           # Modern ls replacement
brew "zoxide"        # Smart cd
brew "atuin"         # Shell history with sync
brew "carapace"      # Universal completions
brew "bat"           # Better cat with syntax highlighting
brew "tmux"          # Terminal multiplexer

# Learning & productivity tools
brew "tlrc"          # Simplified man pages (tldr client)
brew "git-delta"     # Beautiful git diffs
brew "duti"          # Set default applications for file types
# Existing packages
brew "fabric-ai"
brew "gh"
brew "git"
brew "nvm"
brew "pnpm"
brew "tailscale", link: false
brew "todoist-cli"
brew "tree"
brew "uv"
brew "supabase/tap/supabase"
cask "1password"
cask "balenaetcher"
cask "bartender"
cask "bazecor"
cask "brave-browser"
cask "claude"
cask "cleanshot"
cask "conductor"
cask "cursor"
cask "daisydisk"
cask "discord"
cask "docker-desktop"
cask "elgato-stream-deck"
cask "elmedia-player"
cask "figma"
cask "ghostty"
cask "google-chrome"
cask "helium-browser"
cask "keyboard-maestro"
cask "logitech-options"
cask "macwhisper"
cask "obsidian"
cask "prismlauncher"
cask "raycast"
cask "steam"
cask "superwhisper"
cask "tailscale-app"
cask "todoist-app"
cask "vivaldi"
cask "zen"
cask "zulu"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "astro-build.astro-vscode"
vscode "dorianmassoulier.repomix-runner"
vscode "eamodio.gitlens"
vscode "jdinhlife.gruvbox"
vscode "mechatroner.rainbow-csv"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-poml.poml"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ritwickdey.liveserver"
vscode "tomoki1207.pdf"
vscode "yzhang.markdown-all-in-one"
