# CLI Tools
brew "eza"               # Modern replacement for ls
brew "bat"               # Modern replacement for cat
brew "ripgrep"           # Modern replacement for grep
brew "fzf"               # Fuzzy finder
brew "zoxide"            # Modern replacement for cd
brew "starship"          # Cross-shell prompt
brew "git"               # Version control
brew "gh"                # GitHub CLI
brew "nvm"               # Node version manager
brew "uv"                # Python package manager
brew "pyenv"             # Python version manager
brew "ollama"            # Local LLM runner

# Essential Applications
cask "1password"         # Password manager
cask "raycast"           # Spotlight replacement
cask "bartender"         # Menu bar organization
cask "bettertouchtool"   # Trackpad/mouse customization
cask "cleanshot"         # Screenshot tool
cask "iterm2"           # Terminal
cask "obsidian"         # Note-taking
cask "karabiner-elements" # Keyboard customization
cask "the-unarchiver"   # Archive extraction

# Development Applications
cask "visual-studio-code" # Code editor
cask "cursor"            # Code editor
cask "warp"             # Modern terminal
cask "docker"           # Containerization
cask "insomnia"         # API client
cask "cyberduck"        # FTP client

# Browsers
cask "firefox"
cask "google-chrome"
cask "arc"              # Modern browser

# Communication & Collaboration
cask "discord"
cask "slack"
cask "zoom"

# Media & Entertainment
cask "vlc"              # Media player
cask "obs"              # Streaming/recording
cask "handbrake"        # Video conversion
cask "plex"             # Media server
cask "transmission"     # Torrent client

# Creative Tools
cask "figma"            # Design tool
cask "imageoptim"       # Image optimization

# Gaming
cask "steam"
cask "openemu"          # Emulator

# Utilities
cask "balenaetcher"     # USB image writer
cask "calibre"          # E-book management